---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateStairForLevelOverlapping
source: html/c0fce9b9-86a2-a334-43ae-95e0fdf11813.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateStairForLevelOverlapping Property

Some of the multistory stairs couldn't be created due to the overlapped levels.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateStairForLevelOverlapping { get; }
```